In [2]:
import pandas as pd

## Analysis of data before cleaning and transformation

In [3]:
path="https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/refs/heads/master/titanic.csv"
df=pd.read_csv(path)
df.head(2)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1

#### Information about the dataframe

In [4]:
df.tail(2)

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
1307,3,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.225,NaN,C,0
1308,3,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.875,NaN,S,0

In [5]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1046 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1308 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1307 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

##### Statistical information

In [7]:
df.describe()

,pclass,age,sibsp,parch,fare,survived
count,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,1309.000000
mean,2.294882,29.881135,0.498854,0.385027,33.295479,0.381971
std,0.837836,14.413500,1.041658,0.865560,51.758668,0.486055
min,1.000000,0.166700,0.000000,0.000000,0.000000,0.000000
25%,2.000000,21.000000,0.000000,0.000000,7.895800,0.000000
50%,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,3.000000,39.000000,1.000000,0.000000,31.275000,1.000000
max,3.000000,80.000000,8.000000,9.000000,512.329200,1.000000

# Data Cleaning

### 1. Fill the null values

Calculate the central values

In [8]:
age_mean      = df['age'].mean()
fare_mean     = df['fare'].mean()
embarked_mode = df['embarked'].mode()[0]

In [9]:
print(age_mean, fare_mean, embarked_mode )

29.8811345124283 33.29547928134557 S

Replace the null values with central values

In [10]:
df['age']      = df['age'].fillna(age_mean)
df['fare']     = df['fare'].fillna(fare_mean)
df['embarked'] = df['embarked'].fillna(embarked_mode)

### 2. Drop the columns/rows which have empty data

###### cabin column which has null values need to be removed
###### auto detects rows and columns which are having missing value 

##### dropna
###### axis=0 (remove rows which has missing data)
###### axis=1 (remove columns which has missing data)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   cabin     295 non-null    object
 9   embarked  1309 non-null   object
 10  survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

In [12]:
df = df.dropna(axis=1)  ## Drops cabin column
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   float64
 8   embarked  1309 non-null   object
 9   survived  1309 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 102.4+ KB

### 3. Convert data type of a column

In [13]:
#convert the fare column datatype 
#astype() --  used to convert dtype of columns
# -- to pass dictionary {'col' : dtype}
df =df.astype({"fare":int})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1309 non-null   int64
 1   name      1309 non-null   object
 2   sex       1309 non-null   object
 3   age       1309 non-null   float64
 4   sibsp     1309 non-null   int64
 5   parch     1309 non-null   int64
 6   ticket    1309 non-null   object
 7   fare      1309 non-null   int64
 8   embarked  1309 non-null   object
 9   survived  1309 non-null   int64
dtypes: float64(1), int64(5), object(4)
memory usage: 102.4+ KB

# Data Transformation

In [14]:
df.head(2)

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151,S,1

In [15]:
df['name'][0]

'Allen, Miss. Elisabeth Walton'

##### 1. Split the full name to title, l_name, f_name

In [16]:
# expand= True gives df else it will be list

temp = df['name'].str.split(".",n=1,expand=True)

In [17]:
temp.head(2)

                 0                  1
0      Allen, Miss   Elisabeth Walton
1  Allison, Master      Hudson Trevor

In [18]:
f_name = temp[1]
t_l_name = temp[0]

list_of_t_l_name = t_l_name.str.split(",",n=1,expand=True)
l_name = list_of_t_l_name[0]
title = list_of_t_l_name[1]

In [19]:
df['title'] = title
df['l_name'] = l_name
df['f_name'] = f_name

##### 2.  Drop full Name column

In [20]:
#drop() -- used to remove the records/rows
#index=[indices of rows]
#columns=[names of columns]

In [21]:
df = df.drop(columns=['name'])

##### 3. Add siblings + parentchild columns  to family_members

In [22]:
df['family_members']=df['sibsp']+df['parch']

##### 4. Drop siblings and parent child columns

In [23]:
df=df.drop(columns=['sibsp','parch'])

##### 5. Rename sex column as gender

In [24]:
#Rename the sex column to gender column 
# rename() -- used to change the name of the rows/columns
#for rows ---> index = {'old_name' : 'new_name',.......}
#for columns ---> columns= {'old_name' : 'new_name',......}

df = df.rename(columns={'sex':'gender'})

In [25]:
df.columns

Index(['pclass', 'gender', 'age', 'ticket', 'fare', 'embarked', 'survived',
       'title', 'l_name', 'f_name', 'family_members'],
      dtype='object')

##### 6. Replace the embarked values with full form

In [26]:
pd.unique(df['embarked'])

array(['S', 'C', 'Q'], dtype=object)

In [27]:
#replace() --> used to replace old_ values by new values
# we have to pass dictionary

mapping = { 'S':'Southampton' ,
            'C':'Cherbourg' ,
            'Q':'Queenstown' }

df['embarked']=df['embarked'].replace(mapping)

##### 7. Reorder the column names

In [28]:
new_order=['title','f_name','l_name','gender', 'age','ticket','pclass','embarked','family_members','fare','survived']

df=df[new_order]

#### 8. Create a categorical column

In [29]:
# 0-2   -> baby
# 2-16  -> child
# 16-25 -> teen
# 25-49 -> adult
# 80+   -> senior

df['age_category'] = pd.cut(df['age'],
                            bins=[0,2,16,25,49,80],
                            labels=['baby','child','teen','adult','senior'])

##### 9. Drop multiple rows where fare == 0

In [30]:
cond = (df['fare']==0)
rowids=df.loc[cond,::].index
rowids

Index([   7,   70,  125,  150,  170,  223,  234,  363,  384,  410,  473,  528,
        581,  896,  898,  963, 1254],
      dtype='int64')

In [31]:
df = df.drop(index=rowids)
df

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.000000,24160,1,Southampton,0,211,1,adult
1,Master,Hudson Trevor,Allison,male,0.916700,113781,1,Southampton,3,151,1,baby
2,Miss,Helen Loraine,Allison,female,2.000000,113781,1,Southampton,3,151,0,baby
3,Mr,Hudson Joshua Creighton,Allison,male,30.000000,113781,1,Southampton,3,151,0,adult
4,Mrs,Hudson J C (Bessie Waldo Daniels),Allison,female,25.000000,113781,1,Southampton,3,151,0,teen
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,Miss,Hileni,Zabour,female,14.500000,2665,3,Cherbourg,1,14,0,child
1305,Miss,Thamine,Zabour,female,29.881135,2665,3,Cherbourg,1,14,0,adult
1306,Mr,Mapriededer,Zakarian,male,26.500000,2656,3,Cherbourg,0,7,0,adult
1307,Mr,Ortin,Zakarian,male,27.000000,2670,3,Cherbourg,0,7,0,adult
1308,Mr,Leo,Zimmerman,male,29.000000,315082,3,Southampton,0,7,0,adult

In [32]:
df.head(2)

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.0000,24160,1,Southampton,0,211,1,adult
1,Master,Hudson Trevor,Allison,male,0.9167,113781,1,Southampton,3,151,1,baby

## Data analysis after cleaning

In [33]:
df.describe()

               age       pclass  family_members         fare     survived
count  1292.000000  1292.000000     1292.000000  1292.000000  1292.000000
mean     29.837829     2.301084        0.895511    33.301858     0.385449
std      12.932916     0.836743        1.590759    51.948287     0.486890
min       0.166700     1.000000        0.000000     3.000000     0.000000
25%      22.000000     2.000000        0.000000     7.000000     0.000000
50%      29.881135     3.000000        0.000000    14.000000     0.000000
75%      35.000000     3.000000        1.000000    31.000000     1.000000
max      80.000000     3.000000       10.000000   512.000000     1.000000

In [34]:
df.shape

(1292, 12)

In [35]:
len(df)

1292

In [36]:
df.count()

title             1292
f_name            1292
l_name            1292
gender            1292
age               1292
ticket            1292
pclass            1292
embarked          1292
family_members    1292
fare              1292
survived          1292
age_category      1292
dtype: int64

In [37]:
df.iloc[0,::]

title                          Miss
f_name             Elisabeth Walton
l_name                        Allen
gender                       female
age                            29.0
ticket                        24160
pclass                            1
embarked                Southampton
family_members                    0
fare                            211
survived                          1
age_category                  adult
Name: 0, dtype: object

In [38]:
df.loc[[0],::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.0,24160,1,Southampton,0,211,1,adult

In [39]:
df.iloc[1:2,::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
1,Master,Hudson Trevor,Allison,male,0.9167,113781,1,Southampton,3,151,1,baby

In [40]:
df.loc[::,['f_name','age']]

                                  f_name        age
0                       Elisabeth Walton  29.000000
1                          Hudson Trevor   0.916700
2                          Helen Loraine   2.000000
3                Hudson Joshua Creighton  30.000000
4      Hudson J C (Bessie Waldo Daniels)  25.000000
...                                  ...        ...
1304                              Hileni  14.500000
1305                             Thamine  29.881135
1306                         Mapriededer  26.500000
1307                               Ortin  27.000000
1308                                 Leo  29.000000

[1292 rows x 2 columns]

In [41]:
df.loc[df['pclass']==1,::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.000000,24160,1,Southampton,0,211,1,adult
1,Master,Hudson Trevor,Allison,male,0.916700,113781,1,Southampton,3,151,1,baby
2,Miss,Helen Loraine,Allison,female,2.000000,113781,1,Southampton,3,151,0,baby
3,Mr,Hudson Joshua Creighton,Allison,male,30.000000,113781,1,Southampton,3,151,0,adult
4,Mrs,Hudson J C (Bessie Waldo Daniels),Allison,female,25.000000,113781,1,Southampton,3,151,0,teen
...,...,...,...,...,...,...,...,...,...,...,...,...
318,Mr,Fletcher Fellows,Williams-Lambert,male,29.881135,113510,1,Southampton,0,35,0,adult
319,Miss,Helen Alice,Wilson,female,31.000000,16966,1,Cherbourg,0,134,1,adult
320,Mr,Hugh,Woolner,male,29.881135,19947,1,Southampton,0,35,1,adult
321,Mr,George,Wright,male,62.000000,113807,1,Southampton,0,26,0,senior
322,Miss,Marie Grice,Young,female,36.000000,PC 17760,1,Cherbourg,0,135,1,adult

In [42]:
df.loc[(df['pclass']==1) & (df['gender']=='male'),::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
1,Master,Hudson Trevor,Allison,male,0.916700,113781,1,Southampton,3,151,1,baby
3,Mr,Hudson Joshua Creighton,Allison,male,30.000000,113781,1,Southampton,3,151,0,adult
5,Mr,Harry,Anderson,male,48.000000,19952,1,Southampton,0,26,1,adult
9,Mr,Ramon,Artagaveytia,male,71.000000,PC 17609,1,Cherbourg,0,49,0,senior
10,Col,John Jacob,Astor,male,47.000000,PC 17757,1,Cherbourg,1,227,0,adult
...,...,...,...,...,...,...,...,...,...,...,...,...
316,Mr,Charles Duane,Williams,male,51.000000,PC 17597,1,Cherbourg,1,61,0,senior
317,Mr,Richard Norris II,Williams,male,21.000000,PC 17597,1,Cherbourg,1,61,1,teen
318,Mr,Fletcher Fellows,Williams-Lambert,male,29.881135,113510,1,Southampton,0,35,0,adult
320,Mr,Hugh,Woolner,male,29.881135,19947,1,Southampton,0,35,1,adult
321,Mr,George,Wright,male,62.000000,113807,1,Southampton,0,26,0,senior

In [43]:
df.loc[(df['pclass']==1) & (df['gender']=='female') & (df['survived']==1),
       ['f_name','age']]

                                     f_name   age
0                          Elisabeth Walton  29.0
6                        Kornelia Theodosia  63.0
8            Edward Dale (Charlotte Lamson)  53.0
11    John Jacob (Madeleine Talmadge Force)  18.0
12                         Leontine Pauline  24.0
..                                      ...   ...
311         George Dennick (Mary Hitchcock)  45.0
314          George Dunton (Eleanor Elkins)  50.0
315                               Constance  21.0
319                             Helen Alice  31.0
322                             Marie Grice  36.0

[139 rows x 2 columns]

In [44]:
cond = ((df['gender']=='female') & (df['survived']==1) & (df['pclass']==1))
cols = ['f_name']
df.loc[cond,cols]

                                     f_name
0                          Elisabeth Walton
6                        Kornelia Theodosia
8            Edward Dale (Charlotte Lamson)
11    John Jacob (Madeleine Talmadge Force)
12                         Leontine Pauline
..                                      ...
311         George Dennick (Mary Hitchcock)
314          George Dunton (Eleanor Elkins)
315                               Constance
319                             Helen Alice
322                             Marie Grice

[139 rows x 1 columns]

In [45]:
cond = ((df['embarked']=='Southampton') | (df['embarked']=='Cherbourg'))
df.loc[cond,::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.000000,24160,1,Southampton,0,211,1,adult
1,Master,Hudson Trevor,Allison,male,0.916700,113781,1,Southampton,3,151,1,baby
2,Miss,Helen Loraine,Allison,female,2.000000,113781,1,Southampton,3,151,0,baby
3,Mr,Hudson Joshua Creighton,Allison,male,30.000000,113781,1,Southampton,3,151,0,adult
4,Mrs,Hudson J C (Bessie Waldo Daniels),Allison,female,25.000000,113781,1,Southampton,3,151,0,teen
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,Miss,Hileni,Zabour,female,14.500000,2665,3,Cherbourg,1,14,0,child
1305,Miss,Thamine,Zabour,female,29.881135,2665,3,Cherbourg,1,14,0,adult
1306,Mr,Mapriededer,Zakarian,male,26.500000,2656,3,Cherbourg,0,7,0,adult
1307,Mr,Ortin,Zakarian,male,27.000000,2670,3,Cherbourg,0,7,0,adult
1308,Mr,Leo,Zimmerman,male,29.000000,315082,3,Southampton,0,7,0,adult

In [46]:
cond = df['embarked'].isin(['Southampton','Cherbourg'])
df.loc[cond,::]

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
0,Miss,Elisabeth Walton,Allen,female,29.000000,24160,1,Southampton,0,211,1,adult
1,Master,Hudson Trevor,Allison,male,0.916700,113781,1,Southampton,3,151,1,baby
2,Miss,Helen Loraine,Allison,female,2.000000,113781,1,Southampton,3,151,0,baby
3,Mr,Hudson Joshua Creighton,Allison,male,30.000000,113781,1,Southampton,3,151,0,adult
4,Mrs,Hudson J C (Bessie Waldo Daniels),Allison,female,25.000000,113781,1,Southampton,3,151,0,teen
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,Miss,Hileni,Zabour,female,14.500000,2665,3,Cherbourg,1,14,0,child
1305,Miss,Thamine,Zabour,female,29.881135,2665,3,Cherbourg,1,14,0,adult
1306,Mr,Mapriededer,Zakarian,male,26.500000,2656,3,Cherbourg,0,7,0,adult
1307,Mr,Ortin,Zakarian,male,27.000000,2670,3,Cherbourg,0,7,0,adult
1308,Mr,Leo,Zimmerman,male,29.000000,315082,3,Southampton,0,7,0,adult

In [47]:
df['ticket'].count()

np.int64(1292)

In [48]:
cond = (df['gender']=='male')
cols = ['gender']
df.loc[cond,cols].count()

gender    826
dtype: int64

In [49]:
cols = ['fare']
df.loc[::,cols].max()

fare    512
dtype: int64

In [50]:
cond = (df['gender']=='female')
cols = ['fare']
df.loc[cond,cols].min()

fare    6
dtype: int64

In [51]:
cond = (df['gender']=='female')
cols = ['fare']
df.loc[cond,cols].max()

fare    512
dtype: int64

In [52]:
cond = df['survived']==1
cols = ['survived']
df.loc[cond,cols].count()

survived    498
dtype: int64

In [53]:
cols = ['survived']
df.loc[::,cols].mean()

survived    0.385449
dtype: float64

In [54]:
# agg() - used to apply aggregates
cond = {'fare':['count','min','max','sum','mean']}
df.agg(cond)

               fare
count   1292.000000
min        3.000000
max      512.000000
sum    43026.000000
mean      33.301858

In [55]:
gp = df.groupby(['gender'])
gp['gender'].count()

gender
female    466
male      826
Name: gender, dtype: int64

In [56]:
gp = df.groupby(['gender'])
gp[['gender']].count()

        gender
gender
female     466
male       826

# select sum(fare), pclass from table groupby pclass

In [57]:
gp_obj = df.groupby(['pclass'])
gp_obj[['fare']].sum()

         fare
pclass
1       28129
2        5806
3        9091

get the pclass wise survival rate and count

In [58]:
gp_obj=df.groupby(['pclass'])
#gp_obj[['survived']].mean()
gp_obj.agg({'survived':['mean','count','sum']})

        survived
            mean count  sum
pclass
1       0.629747   316  199
2       0.439114   271  119
3       0.255319   705  180

In [59]:
gp_obj = df.groupby(['pclass','gender'])
gp_obj[['survived']].mean()

               survived
pclass gender
1      female  0.965278
       male    0.348837
2      female  0.886792
       male    0.151515
3      female  0.490741
       male    0.151329

In [60]:
gp_obj = df.groupby(['pclass','gender'])
gp_obj['survived'].mean().unstack()  ## to make it show as columns

gender    female      male
pclass
1       0.965278  0.348837
2       0.886792  0.151515
3       0.490741  0.151329

In [61]:
gp_obj = df.groupby(['pclass','gender'])
gp_obj.agg({'survived': ['count','mean']})

              survived
                 count      mean
pclass gender
1      female      144  0.965278
       male        172  0.348837
2      female      106  0.886792
       male        165  0.151515
3      female      216  0.490741
       male        489  0.151329

In [62]:
gp_obj = df.groupby(['pclass','gender'])
gp_obj.agg({'survived': ['count','mean']}).unstack()

       survived
          count           mean
gender   female male    female      male
pclass
1           144  172  0.965278  0.348837
2           106  165  0.886792  0.151515
3           216  489  0.490741  0.151329

In [63]:
gp_obj = df.groupby(['pclass'])
gp_obj[['pclass']].count()

        pclass
pclass
1          316
2          271
3          705


Find which pclass is having higest no. of passengers

In [64]:
gp_obj = df.groupby(['pclass'])
gp_obj['pclass'].count().idxmax() ## idxmax - gives the index where value is maximum

np.int64(3)

Find which pclass is having min no. of passengers

In [65]:
gp_obj = df.groupby(['pclass'])
gp_obj['pclass'].count().idxmin() ## idxmax - gives the index where value is maximum

np.int64(2)

Find the no. of families travelling - Hint 1 ticket No for 1 family

In [66]:
gp_obj = df.groupby(['ticket','l_name'])
gp_obj[['ticket','l_name']].count().shape[0]

1008

if its only 1 person we should ignore

In [67]:
df[df['l_name']=='Abelseth']

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category
604,Miss,Karen Marie,Abelseth,female,16.0,348125,3,Southampton,0,7,1,child
605,Mr,Olaus Jorgensen,Abelseth,male,25.0,348122,3,Southampton,0,7,1,teen

In [68]:
gp_obj = df.groupby(['l_name','ticket'])
c_df = gp_obj[['ticket','l_name']].count()
c_df

                             ticket  l_name
l_name        ticket
Abbing        C.A. 5547           1       1
Abbott        C.A. 2673           3       3
Abelseth      348122              1       1
              348125              1       1
Abelson       P/PP 3381           2       2
...                             ...     ...
de Mulder     345774              1       1
de Pelsmaeker 345778              1       1
del Carlo     SC/PARIS 2167       2       2
van Billiard  A/5. 851            3       3
van Melkebeke 345777              1       1

[1008 rows x 2 columns]

In [69]:
gp_obj = df.groupby(['l_name','ticket'])
c_df = gp_obj[['ticket','l_name']].count()
c_df[c_df>1].count()

ticket    175
l_name    175
dtype: int64

Find the no. of families travelling and survival rate

In [70]:
df2 = df.copy(True)

In [71]:
df2["Family_ID"] = df2["l_name"] + "_" + df2["ticket"].astype(str)

# Count unique families
num_families = df2["Family_ID"].nunique()

# Calculate family survival rate
family_survival_rate = df2.groupby("Family_ID")["survived"].mean().mean()

print(f"Number of families traveling: {num_families}")
print(f"Average family survival rate: {family_survival_rate:.2f}")

Number of families traveling: 1008
Average family survival rate: 0.36

Find the correlation between the numerical columns

In [72]:
df.corr(numeric_only=True)

                     age    pclass  family_members      fare  survived
age             1.000000 -0.366397       -0.196047  0.174783 -0.049676
pclass         -0.366397  1.000000        0.046349 -0.570109 -0.321205
family_members -0.196047  0.046349        1.000000  0.222935  0.023038
fare            0.174783 -0.570109        0.222935  1.000000  0.241527
survived       -0.049676 -0.321205        0.023038  0.241527  1.000000

Find the correlation b/w fare and pclass

In [73]:
cols = ['fare','pclass']
df[cols].corr()

            fare    pclass
fare    1.000000 -0.570109
pclass -0.570109  1.000000

Find the correlation b/w fare and pclass

In [74]:
cols = ['fare','survived']
df[cols].corr()

              fare  survived
fare      1.000000  0.241527
survived  0.241527  1.000000

Find the correlation b/w age and survived

In [75]:
cols = ['age','survived']
df[cols].corr()

               age  survived
age       1.000000 -0.049676
survived -0.049676  1.000000

get the pclass wise male and female count and survival rate

In [76]:
grp_obj = df.groupby(['pclass','gender'])
grp_obj.agg({'survived':['count','mean']})

              survived
                 count      mean
pclass gender
1      female      144  0.965278
       male        172  0.348837
2      female      106  0.886792
       male        165  0.151515
3      female      216  0.490741
       male        489  0.151329

In [77]:
grp_obj = df.groupby(['age_category'],observed=False)
grp_obj.agg({'survived':['mean', 'count']})

              survived
                  mean count
age_category
baby          0.617647    34
child         0.530000   100
teen          0.368078   307
adult         0.360324   741
senior        0.400000   110

In [78]:
grp_obj = df.groupby(['age_category'],observed=False)
grp_obj.agg({'survived':['mean']}).idxmax()

survived  mean    baby
dtype: category
Categories (5, object): ['baby' < 'child' < 'teen' < 'adult' < 'senior']

In [79]:
grp_obj = df.groupby(['gender','age_category'],observed=False)
grp_obj.agg({'survived':['mean']}).idxmax()

survived  mean    (female, senior)
dtype: object

In [80]:
grp_obj = df.groupby(['gender','age_category','pclass'],observed=False)
grp_obj.agg({'survived':['mean']}).idxmax()

survived  mean    (female, baby, 2)
dtype: object

In [82]:
df2 = df.copy(True)
df2["Family_ID"] = df2["l_name"] + "_" + df2["ticket"].astype(str)
grp_obj = df2.groupby("Family_ID")

,title,f_name,l_name,gender,age,ticket,pclass,embarked,family_members,fare,survived,age_category,Family_ID
0,Miss,Elisabeth Walton,Allen,female,29.0000,24160,1,Southampton,0,211,1,adult,Allen_24160
1,Master,Hudson Trevor,Allison,male,0.9167,113781,1,Southampton,3,151,1,baby,Allison_113781